trade_exp/src/Documents/ПроверкаЦенников/ПроверкаЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fd17951c-1da2-49db-9c7e-f3150fc241fe">
  <name>ПроверкаЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4a70e6fe-639f-44de-b3fd-237230052dc1">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5034a4d7-93d7-48ba-a44d-fdf429bc2eac">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7b9df7f-e2d1-4043-b06e-85fd4416f45a">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c849c33d-d44b-4398-9231-c9df953c93e2">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f9936d4d-9ec9-462a-8a56-f4dc8a27e883">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="59518efd-1ffc-47bb-919d-987145052d36">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33f586b2-0658-4db5-a72d-9f3fb3f64b70">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d65bbef-e89d-4630-ad15-da4215e03885">
    <name>ОтборПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c0981d1-37a3-4097-943b-888d82353308">
    <name>ДополнительноеСведениеКолонки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6412a95-3905-47a5-b58c-42ddc3273893">
    <name>ВидПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6ed79a42-e86c-4a2e-bcdd-4741381451bd">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="85673eb7-8a97-4e43-8918-bc1fd724a199">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00cebe0f-6fe8-498f-9da3-00097fb7b1ff">
      <name>ЦенаТекущая</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="43b8f031-f17d-450b-8d5d-9331b98c3e40">
      <name>ЦенаНаЦеннике</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bee02909-0b00-49d6-8e3a-17bdc46db3f3">
      <name>ЕстьРасхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b14de1c9-ce62-446e-b7f4-1e380660b377">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="307a9612-2229-444e-9ab6-16cbcdd055e0">
      <name>НетЦенника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12fd7174-1d80-46c0-8a1c-1bef2134ec91">
      <name>ДополнительноеСведение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c7bc165d-b056-49f4-9989-2b83551a416e">
      <name>Проверено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПроверкаЦенников/Forms/ФормаДокументаДляТСД/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	УстановитьОграничениеДополнительногоСведения()
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеДополнительногоСведения()
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ(Свойство) КАК Свойство
					|ИЗ РегистрСведений.ДополнительныеСведения
					|ГДЕ ТипЗначения(Объект) = ТИП(Справочник.Номенклатура)";
    Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыВыбораДополнительногоСведения = Новый Массив();	
	
	ДоступныеДополнительныеСведения = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеДополнительныеСведения.Добавить(Выборка.Свойство);	
	КонецЦикла;
	
	Параметр = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(ДоступныеДополнительныеСведения)
			);	
	
	ПараметрыВыбораДополнительногоСведения.Добавить(Параметр);
	
	Элементы.ДополнительноеСведениеКолонки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДополнительногоСведения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
    ИнициализироватьСканер();
	Если Объект.ВидПроверки = ПредопределенноеЗначение("Перечисление.ВидПроверкиЦенников.Попереоценке") Тогда
		Элементы.ТоварыНетЦенника.Заголовок = "Акт. Цен.";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
	ОтключитьСканер();

КонецПроцедуры

#КонецОбласти



#Область РаботаСоСканеромИШтрихкодами

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				МассивПараметров =  Параметр;
			иначе
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(Параметр);
				МассивПараметров.Добавить(Неопределено);
			конецесли;

			ДанныеШтрихкодов= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВМассив(МассивПараметров);
			Если ДанныеШтрихкодов.Количество() > 0 Тогда
			Штрихкод = ДанныеШтрихкодов[0].Штрихкод;
			
			ОбработатьШтрихкоды(Штрихкод);
		Иначе
			ПоказатьПредупреждение(, "Штрихкод неверного формата!", 5);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрихкодКамера(Команда)
			#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкодаКамера",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			ПоказатьПредупреждение(, "Сканирование не поддерживается!", 5);
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкодаКамера(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		Если ПустаяСтрока(Штрихкод) Тогда
			ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз", 5);
			Возврат;
		КонецЕсли;
			
		
		ОбработатьШтрихкоды(Штрихкод);		

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод);
	
	
	Номенклатура = "";
	ДополнительноеСведение = "";
	ЦенаТекущая = 0;
	ПолучитьДанныеПоШтрихкоду(Штрихкод, Номенклатура, ДополнительноеСведение, ЦенаТекущая);
	
	ЕстьТовар = Ложь;
	НайденнаяСтрока = Неопределено;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура");
	СтруктураПоиска.Номенклатура = Номенклатура;
	МассивСтрок = Объект.Товары.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() > 0 Тогда
		ЕстьТовар = Истина;		
		НайденнаяСтрока = МассивСтрок[0];
		
		Если НайденнаяСтрока.Штрихкод = "" Тогда
			 НайденнаяСтрока.Штрихкод = Штрихкод;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ЕстьТовар Тогда
		                      
		Если Не НайденнаяСтрока.Проверено Тогда
		
			Текст = Строка(НайденнаяСтрока.Номенклатура) + Символы.ПС + "Текущая цена: "+ Формат(НайденнаяСтрока.ЦенаТекущая, "ЧДЦ=2");
			Если Строка(НайденнаяСтрока.ДополнительноеСведение) <> "" Тогда
				Текст = Текст + Символы.ПС + "Доп. сведение: " + Строка(НайденнаяСтрока.ДополнительноеСведение) 
			КонецЕсли;
			Текст = Текст + Символы.ПС + "Правильная цена на ценнике?";
		
			ДопПараметры = Новый Структура("НомерСтроки", НайденнаяСтрока.НомерСтроки);
			ОповещениеПослеЗакрытияВопроса = Новый ОписаниеОповещения("ПослеПроверкиСтроки", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеЗакрытияВопроса, Текст, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да);
		Иначе
			Текст = Строка(НайденнаяСтрока.Номенклатура) + Символы.ПС + "Текущая цена: "+ Формат(НайденнаяСтрока.ЦенаТекущая, "ЧДЦ=2");
			Если Строка(НайденнаяСтрока.ДополнительноеСведение) <> "" Тогда
				Текст = Текст + Символы.ПС + "Доп. сведение: " + Строка(НайденнаяСтрока.ДополнительноеСведение) 
			КонецЕсли;
			Текст = Текст + Символы.ПС + "Внести в список с расхождениями?";
		    Текст = "Номенклатура уже была проверена в документе!" + Символы.ПС + Текст; 
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Штрихкод", Штрихкод);
			ДопПараметры.Вставить("Номенклатура", Номенклатура);
			ДопПараметры.Вставить("ЦенаТекущая", ЦенаТекущая);
			ДопПараметры.Вставить("ДополнительноеСведение", ДополнительноеСведение);
			ОповещениеПослеЗакрытияВопроса = Новый ОписаниеОповещения("ВопросДобавлениеСтроки", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеЗакрытияВопроса, Текст, РежимДиалогаВопрос.ДаНетОтмена, 10, КодВозвратаДиалога.Да);

		КонецЕсли;	
		
	Иначе
		
		Если Номенклатура <> "" Тогда
			Если ЦенаТекущая <> 0 Тогда
				
			Текст = Строка(Номенклатура) + Символы.ПС + "Текущая цена: "+ Формат(ЦенаТекущая, "ЧДЦ=2");
			Если Строка(ДополнительноеСведение) <> "" Тогда
				Текст = Текст + Символы.ПС + "Доп. сведение: " + Строка(ДополнительноеСведение) 
			КонецЕсли;
			Текст = Текст + Символы.ПС + "Внести в список с расхождениями?";
		
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Штрихкод", Штрихкод);
			ДопПараметры.Вставить("Номенклатура", Номенклатура);
			ДопПараметры.Вставить("ЦенаТекущая", ЦенаТекущая);
			ДопПараметры.Вставить("ДополнительноеСведение", ДополнительноеСведение);
			ОповещениеПослеЗакрытияВопроса = Новый ОписаниеОповещения("ВопросДобавлениеСтроки", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеЗакрытияВопроса, Текст, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да);
				
			Иначе
				Текст = "У номенклатуры """ + Символы.ПС + Номенклатура +  """" + Символы.ПС + "нет цены по виду: " + Объект.ВидЦены + "!";
				ПоказатьПредупреждение(, Текст, 5);
			КонецЕсли;
			
		Иначе
			ПоказатьПредупреждение(, "Не удалось найти номенклатуру по штрихкоду!", 5);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеПоШтрихкоду(Штрихкод, Номенклатура, ДополнительноеСведение, ЦенаТекущая)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение		
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ШтрихкодыНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ШтрихкодыНоменклатуры.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ШтрихкодыНоменклатуры.Номенклатура.Ссылка = ДополнительныеСведения.Объект 
		|        	И ДополнительныеСведения.Свойство = &Свойство
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦены);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Свойство", Объект.ДополнительноеСведениеКолонки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Номенклатура = "";
	ДополнительноеСведение = "";
	ЦенаТекущая = 0;	
	
	Если Выборка.Следующий() Тогда
		Номенклатура = Выборка.Номенклатура;
		ДополнительноеСведение = Выборка.ДополнительноеСведение;
		ЦенаТекущая = Выборка.ЦенаТекущая;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти



#Область Оповещения

&НаКлиенте
Процедура ПослеПроверкиСтроки(Результат, ДопПараметры) Экспорт
	
	ТекСтрока = Объект.Товары[ДопПараметры.НомерСтроки-1];
	ТекСтрока.Проверено = Истина;
	
	Если Результат = КодВозвратаДиалога.Да Или Результат = КодВозвратаДиалога.Таймаут Тогда
		ТекСтрока.ЕстьРасхождения = Ложь;
		ТекСтрока.НетЦенника = Ложь;
	Иначе
		ТекСтрока.ЕстьРасхождения = Истина;
		ТекСтрока.НетЦенника = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросДобавлениеСтроки(Результат, ДопПараметры) Экспорт
	
		НоваяСтрока = Объект.Товары.Добавить();
		ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
		
		НоваяСтрока.Штрихкод = ДопПараметры.Штрихкод;
		НоваяСтрока.Номенклатура = ДопПараметры.Номенклатура;
		НоваяСтрока.ЦенаТекущая = ДопПараметры.ЦенаТекущая;
		НоваяСтрока.ДополнительноеСведение = ДопПараметры.ДополнительноеСведение;   
		НоваяСтрока.Проверено = Истина;  
		
	Если Результат = КодВозвратаДиалога.Да Или Результат = КодВозвратаДиалога.Таймаут Тогда
		
		НоваяСтрока.НетЦенника = Истина;
		НоваяСтрока.ЕстьРасхождения = Истина;
	Иначе
		НоваяСтрока.НетЦенника = Ложь;
		НоваяСтрока.ЕстьРасхождения = Ложь;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




#Область РаботаСТабличнойЧастьюТОвары

&НаКлиенте
Процедура ВернутьсяКТЧ(Команда)
	Элементы.РедактированиеДокументаНаТСД.Видимость=Истина;
	Элементы.РедактированиеСтрокиНаТСД.Видимость=Ложь;
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьЦенуИСвойство(ВидЦены, ДополнительноеСведениеКолонки, Номенклатура, ЦенаТекущая, ДополнительноеСведение)
	Запрос = Новый Запрос;
	Запрос.Текст =			
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение		
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура.Ссылка = ДополнительныеСведения.Объект 
		|        	И ДополнительныеСведения.Свойство = &Свойство
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
		
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Свойство", ДополнительноеСведениеКолонки);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда	
		ЦенаТекущая = Выборка.ЦенаТекущая;	
		ДополнительноеСведение = Выборка.ДополнительноеСведение;	
	Иначе
		ЦенаТекущая = 0;	
		ДополнительноеСведение = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();	
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
	
	Элементы.РедактированиеДокументаНаТСД.Видимость=Ложь;
	Элементы.ВыборНоменклатуры.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатура1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.РедактированиеСтрокиНаТСД.Видимость=Истина;
	Элементы.ВыборНоменклатуры.Видимость = Ложь;
	
	Номенклатура = "";
	ДополнительноеСведение = "";
	//ЦенаНаЦеннике = 0;
	ЦенаТекущая = 0;
	НетЦенника = Ложь;
	ЕстьРасхождения = Ложь;
	
	
	Номенклатура = Элементы.СписокНоменклатура.ТекущиеДанные.Ссылка;
	ПолучитьЦенуИСвойство(Объект.ВидЦены, Объект.ДополнительноеСведениеКолонки, Номенклатура, ЦенаТекущая, ДополнительноеСведение);	

	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.ЦенаТекущая = ЦенаТекущая;
	НоваяСтрока.ДополнительноеСведение = ДополнительноеСведение;

	ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;

	ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);

	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД)
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
				
		Если ТипЗнч(ТекущаяСтрокаТСД) <> Тип("Неопределено") Тогда
			
			ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
			
			Номенклатура = "";
			//ЦенаНаЦеннике = 0;
			ЦенаТекущая = 0;
			НетЦенника = Ложь;
			ЕстьРасхождения = Ложь;
					
			Если ЭлементСписка <> Неопределено Тогда
				Элементы.РедактированиеДокументаНаТСД.Видимость=Ложь;
				Элементы.РедактированиеСтрокиНаТСД.Видимость=Истина;
				Номенклатура = ЭлементСписка.Номенклатура;
				ЦенаТекущая = ЭлементСписка.ЦенаТекущая;
				//ЦенаНаЦеннике = ЭлементСписка.ЦенаНаЦеннике;
				НетЦенника = ЭлементСписка.НетЦенника;
				ЕстьРасхождения = ЭлементСписка.ЕстьРасхождения;
			Конецесли;
			
		Иначе
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
			КонецЕсли;
			Сообщить("Штрихкод не найден!");
		КонецЕсли;
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НетЦенникаПриИзменении(Элемент)
	СтрокаИзменения = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	СтрокаИзменения.НетЦенника = НетЦенника; 
	СтрокаИзменения.Проверено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЕстьРасхожденияПриИзменении(Элемент)
	СтрокаИзменения = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	СтрокаИзменения.ЕстьРасхождения = ЕстьРасхождения; 
	СтрокаИзменения.Проверено = Истина;
КонецПроцедуры


#КонецОбласти
